$(function(){
    var screenH = $(document).height();
    $('.nav-info').height(screenH);
    $('.wrap').height(screenH);
    //首页画廊功能
    var photoData = [
        "img/3步练师.jpg,安恤:,出牌阶段，你可以选择两名手牌数不相等的其他角色，令其中手牌少的角色获得手牌多的角色一张手牌并展示之，若该牌不为黑桃，你摸一张牌。每阶段限一次。,追忆:,你死亡时，可以令一名其他角色（杀死你的角色除外）摸三张牌并回复1点体力。",
        "img/3孙尚香.jpg,结姻:,出牌阶段，你可以弃两张手牌并指定一名受伤的男性角色：你和目标角色各回复1点体力。每回合限用一次。,枭姬:,当你失去一张装备区里的牌时，你可以立即摸两张牌。",
        "img/1钟会.jpg,权计:,每当你受到1点伤害后，你可以摸一张牌，然后将一张手牌置于你的武将牌上，称为“权”；锁定技，你的手牌上限+X（X为“权”的数量）,自立:,觉醒技，准备阶段开始时，若“权”的张数不小于3，你减1点体力上限，选择一项：1.回复1点体力；2.摸两张牌。然后你获得“排异”。,排异:,出牌阶段限一次，你可将一张“权”置入弃牌堆并选择一名角色，令其摸两张牌，然后若其手牌多于你，你对其造成1点伤害。",
        "img/1张春华.jpg",
        "img/3诸葛恪.jpg",
        "img/4贾诩.jpg",
        "img/1甄姬.jpg",
        "img/1荀攸.jpg",
        "img/2姜维.jpg",
        "img/4貂蝉.jpg"
    ];
    //背面文字函数
    //function distill(index){
    //    var arrData = photoData[index].split(','),
    //        html = '';
    //    for(var j=1;j<arrData.length;j++){
    //        if(j%2 == 0){
    //            continue;
    //        }else{
    //            html += '<div class="desc-skill">' +
    //                '<strong>'+ arrData[j] +'</strong>' +
    //                '<span>'+ arrData[j+1] +'</span>' +
    //                '</div>';
    //        }
    //    }
    //    return html;
    //}
    var photoHtml = '', nav = [];
    for(var i=0;i<photoData.length;i++){
        photoHtml += '<div class="photo photo-front" onclick="turn(this)" id="photo'+ i +'">' +
            '<div class="photo-wrap">' +
            '<div class="side side-front">' +
            '<p class="image">' +
            '<img src="'+ photoData[i].split(',')[0] +'" alt=""></p></div>' +
            '<div class="side side-back">' +
            //'<div class="desc"></div>' +
            '</div></div></div>';

        nav.push('<span id="nav_'+i+'" class="i" onclick="turn(\'#photo'+i+'\')"></span>');
    }
    photoHtml += '<div class="nav">'+ nav.join('') +'</div>';
    $('.wrap').append(photoHtml);
    //随机数选定初始化居中图片
    var rand = Math.floor(Math.random() * photoData.length + 0);
    resort(rand);

    //初始化滚动条选中的元素
    $('.i').removeClass('i_cur');
    $('.i').removeClass('i_back');
    $('#nav_'+rand).addClass('i_cur');
    //获取随机数
    function random(obj){
        var num = obj[1] - obj[0];
        var ran = Math.floor(Math.random()*num + obj[0]);
        return ran;
    }
    //设置wrap的范围
    function range(){
        var range = {
            left: {x:[], y:[]},
            right: {x:[], y:[]}
        }
        var wrap = {
            w: $('.wrap').width(),
            h: $('.wrap').height()
        }
        var photo = {
            w: $('.photo:first').width(),
            h: $('.photo:first').height()
        }
        range.wrap = wrap;
        range.photo = photo;
        //左分区取值范围
        range.left.x = [0 - photo.w/4, wrap.w/2 - photo.w/2];
        range.left.y = [photo.h/2, wrap.h];
        //右分区取值范围
        range.right.x = [wrap.w/2 + photo.w/2, wrap.w + photo.w/2];
        range.right.y = [photo.h/2, wrap.h];

        return range;
    }
    //随机图片居中(并绑定事件),分割数组重排序
    function resort(rand){
        //格式化所有的样式
        $('.photo').removeClass('photo_center');
        $('.photo').removeClass('photo-front');
        $('.photo').removeClass('photo-back');
        $('.photo').css({"left": '', 'top': '', "-webkit-transform": 'rotate(0deg)', "-moz-transform": 'rotate(0deg)', "-webkit-transform": 'scale(1.1)', "-moz-transform": 'scale(1.1)'});
        $('.photo').addClass('photo-front');//初始化

        var $photoId = $('#photo'+ rand);
        $photoId.addClass('photo_center');
        //分割数组
        var photos = $('.photo');//类数组对象需要转换成数组对象
        var _photo = [];
        for(var i=0;i<photos.length;i++){
            _photo.push(photos[i]);
        }
        //计算左右分区的范围
        _photo.splice(rand, 1);
        var photoLeft = _photo.splice(0, Math.floor(_photo.length/2));
        var photoRight = _photo;
        var ranges = range();
        for( i in photoLeft){
            var l = random(ranges.left.x);
            var t = random(ranges.left.y);
            $(photoLeft[i]).css('left', l);
            $(photoLeft[i]).css('top', t);
            $(photoLeft[i]).css({"-webkit-transform": 'rotate('+ random([-120, 120]) +'deg)', "-moz-transform": 'rotate('+ random([-120, 120]) +'deg)'});
        }
        for(i in photoRight){
            var l = random(ranges.right.x);
            var t = random(ranges.right.y);
            $(photoRight[i]).css('left', l);
            $(photoRight[i]).css('top', t);
            $(photoRight[i]).css({"-webkit-transform": 'rotate('+ random([-120, 120]) +'deg)', "-moz-transform": 'rotate('+ random([-120, 120]) +'deg)'});
        }
    }
    //翻面函数
    turn = function(ele){
        var photoId = $(ele).attr('id').match(/\d/g).toString();
        if(!$(ele).hasClass('photo_center')){
            $('.i').removeClass('i_cur');
            $('#nav_'+photoId).addClass('i_cur');
            return resort(photoId);
        }
        if($(ele).hasClass('photo-front')){
            $(ele).removeClass('photo-front');
            $(ele).addClass('photo-back');
        }else{
            $(ele).removeClass('photo-back');
            $(ele).addClass('photo-front');
        }
    }

//详细武将列表功能
    var arrData = [
        {
            "name": "甄 姬", "src": "1甄姬.jpg", "id": "1", "audioSrc": [{"audio": "data/audio/甄姬倾国.mp3"}, {"audio": "data/audio/甄姬洛神.mp3"}],
            "skills": [{"skill": "倾国", "details": "你可以将你的黑色手牌当【闪】使用(或打出)。"},
                {"skill": "洛神", "details": "回合开始阶段，你可以进行判定：若为黑色，立即获得此生效后的判定牌，并可以再次使用洛神，如此反复，直到出现红色或你不愿意判定了为止。"}
            ],
            "val": [{"attack": "80%"}, {"alive": "88%"}, {"ability": "82%"}],
            "charactor": "甄姬(183年-221年)，又称甄夫人。魏文帝曹丕的正室，魏明帝曹睿之生母。原为袁熙之妻，曹操攻取邺，与袁绍之妻刘氏一同被曹丕保护，生下曹睿，之后曹丕登上帝位后迎娶了郭贵妃，于是便失去宠爱。曹睿登帝位后追封为文昭皇后。",
            "feature": "甄姬的洛神是一个很强的多摸牌技能，且黑牌较多是攻击和关键锦囊牌所以甄姬的爆发很高，倾国很好的加强了她的防御弥补一下她血量少的一个短板。"
        },
        {
            "name": "貂 蝉", "src": "4貂蝉.jpg", "id": "4", "audioSrc": [{"audio": "data/audio/貂蝉离间.mp3"}, {"audio": "data/audio/貂蝉闭月.mp3"}],
            "skills": [{"skill": "离间", "details": "出牌阶段，你可以弃一张牌并选择两名男性角色。若如此作，视为其中一名男性角色对另一名男性角色使用一张【决斗】。(此【决斗】不能被【无懈可击】响应)。每回合限用一次。"},
                {"skill": "闭月", "details": "回合结束阶段，可摸一张牌。"}
            ],
            "val": [{"attack": "93%"}, {"alive": "80%"}, {"ability": "82%"}],
            "charactor": "中国“四大美女”—王昭君、西施、貂蝉和杨玉环，可以说要数貂蝉最迷人、最出彩，她竟使吕布、董卓等英雄豪杰为之而神魂颠倒，纷纷拜倒在石榴裙下。当然，也数她最不可捉摸，查阅各种书籍，包括《三国志》、《后汉书》在内的正史中，我们都没有发现任何明确的有关貂蝉的记载，至今人们还不清楚她的真面目，这一切使得貂蝉的身世更加扑朔迷离。",
            "feature": "貂蝉（八神将）离间是一个非常强力且稳定的输出技能，就算在断杀的情况下也可以为团队提供稳定的输出可以说这是一个非常神的技能，同样作为三血武将偏脆但闭月弥补了这一短板而且加强了貂蝉的手牌上限。"
        },
        {
            "name": "孙尚香", "src": "3孙尚香.jpg", "id": "3", "audioSrc": [{"audio": "data/audio/孙尚香结姻.mp3"}, {"audio": "data/audio/孙尚香枭姬.mp3"}],
            "skills": [{"skill": "结姻", "details": "出牌阶段，你可以弃两张手牌并指定一名受伤的男性角色：你和目标角色各回复1点体力。每回合限用一次。"},
                {"skill": "枭姬", "details": "当你失去一张装备区里的牌时，你可以立即摸两张牌。"}
            ],
            "val": [{"attack": "79%"}, {"alive": "70%"}, {"ability": "80%"}],
            "charactor": "孙尚香是三国时期的主要女性人物之一，即孙夫人。史书《汉晋春秋》记载名为孙仁献。原为东吴郡主，后嫁与刘备。孙坚与吴夫人之女，孙策、孙权、孙翊、孙匡、孙朗之妹，刘备的三夫人。孙尚香自幼喜好武艺，手下侍女皆带刀具，常以与人击剑为乐，身带利器又容姿甚美。因为她作为并且志胜男儿，因此自然而然被人们称为“枭姬”。 ",
            "feature": "香香偏团队辅助当然也可以通过装备的流转进行爆发，最好配合的便是她的母亲吴国太。结姻可以很好的对团队受伤的男性角色提供奶力，同样杀人先断奶香香则会成为优先集火目标，而香香又没有防御技能且是三血武将生存力便弱一点。枭姬可以为她提供一波小爆发但武器牌毕竟有限除非有武将能够配合。"
        },
        {
            "name": "姜 维", "src": "2姜维.jpg", "id": "2", "audioSrc": [{"audio": "data/audio/姜维挑衅.mp3"}, {"audio": "data/audio/姜维志继.mp3"}, {"audio": "data/audio/姜维观星.mp3"}],
            "skills": [{"skill": "挑衅", "details": "出牌阶段，你可以指定一名你在其攻击范围内的角色，该角色选择一项：对你使用一张【杀】，或令你弃置其一张牌。每阶段限一次。"},
                {"skill": "志继", "details": "觉醒技，回合开始阶段开始时，若你没有手牌，你须回复1点体力或摸两张牌，然后减1点体力上限，并获得技能“观星”。"},
                {"skill": "观星", "details": "自己回合开始前,可查看牌堆顶的三张牌,将其中任意数量的牌以任意顺序置于牌堆底,其余则以任意顺序置于牌堆顶。"}
            ],
            "val": [{"attack": "80%"}, {"alive": "83%"}, {"ability": "95%"}],
            "charactor": "姜维（字伯约），诸葛亮北伐时，姜维被怀疑有异心，姜维不得已投降蜀汉。诸葛亮去世后姜维北伐总计大胜两次；小胜三次；相距不克四次；大败一次，小败一次。司马昭五道伐蜀，姜维据守剑阁，阻挡住钟会大军，却被邓艾从阴平偷袭成都，刘禅投降。后姜维希望凭自己的力量复兴蜀汉，假意投降魏将钟会，打算利用钟会反叛曹魏以实现恢复汉室的愿望，但最终钟会反叛失败，姜维与钟会一同被魏军所杀。",
            "feature": "姜维(小八神)个人能力非常强，就算在没有觉醒之前也可以通过挑衅做到每回合为团队做贡献，可以说菜刀流武将在姜维旁边就会被废掉。当姜维觉醒之后他的强度又立马上升了一个档次，观星的过牌量和挑衅的强制出牌让姜维能够打出最大化的输出和作用。玩姜维有一条：选他就不要怂。"

        },
        {
            "name": "周 瑜", "src": "3周瑜.jpg", "id": "3", "audioSrc": [{"audio": "data/audio/周瑜英姿.mp3"}, {"audio": "data/audio/周瑜反间.mp3"}],
            "skills": [{"skill": "英姿", "details": "摸牌阶段，你可以额外摸一张牌。"},
                {"skill": "反间", "details": "出牌阶段，你可以指定一名目标角色：该角色选择一种花色，抽取你的一张手牌并亮出，若此牌与所选花色不吻合，则你对该角色造成1点伤害。无论结果如何该角色获得此牌。每回合限用一次。"}
            ],
            "val": [{"attack": "87%"}, {"alive": "65%"}, {"ability": "75%"}],
            "charactor": "周瑜（字公瑾），长壮有姿貌、精音律，江东有“曲有误，周郎顾”之语。周瑜少与孙策交好，21岁起随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事。208年周瑜率江东孙氏集团军队与刘备军队联合，赤壁之战大败曹军，由此奠定了三分天下的基础。公元210年病逝于巴丘（今湖南岳阳），年仅36岁。",
            "feature": "周瑜英姿多一张摸牌是一个非常好的技能，单挑的时候很强势。反间提高了他的输出不过经验的玩家对反间一般都会选方片，但无法掩盖反间还是不错的输出技能。缺点怕控制因为技能都是回合内的主动技能且他只有三血生存能力也较弱，假如能保持手牌上限的话那么强度会上升一个档次。"
        },
        {
            "name": "蔡文姬", "src": "1蔡文姬.jpg", "id": "1", "audioSrc": [{"audio": "data/audio/蔡文姬悲歌.mp3"}, {"audio": "data/audio/蔡文姬断肠.mp3"}],
            "skills": [{"skill": "悲歌", "details": "一名角色每受到【杀】造成的一次伤害，你可以弃一张牌，并令其进行一次判定，判定结果为：红桃~该角色回复1点体力；方块~该角色摸两张牌；梅花~伤害来源弃两张牌；黑桃~伤害来源将其武将牌翻面。"},
                {"skill": "断肠", "details": "锁定技，杀死你的角色失去当前的所有技能直到游戏结束。"}
            ],
            "val": [{"attack": "50%"}, {"alive": "90%"}, {"ability": "60%"}],
            "charactor": "蔡文姬，名蔡琰，字文姬，是我国东汉末年的女诗人。《悲愤诗》是蔡文姬和董把婚后所作，她在诗中饱含血泪叙述了长期痛苦的经历。这首诗可贵之处，不仅写了个人的遭遇，也写出了广大人民的苦难，是对东汉王朝的腐朽统治和匈奴奴隶主贵族的揭露和控诉。 蔡文姬可谓是历尽坎坷，可想而已，在多少年前那样的封建社会历史背景下，她竟然能够一生中嫁了三个丈夫，而且还留下了两个儿子在匈奴牵肠挂肚，不说别的，单其她的凄惨现状就可想而知。",
            "feature": "蔡文姬一个纯粹辅助的武将，输出能力仅限于杀和其他锦囊。但保护团队核心是非常强的一个点，保证自己团队的核心的生存能力。而且自己自带一个“负面”技能（悲歌），直接让对方的武将变成白板，应该说文姬作为忠臣比较合格的但缺点也很明显。"
        },
        {
            "name": "步练师", "src": "3步练师.jpg", "id": "3", "audioSrc": [{"audio": "data/audio/步练师安恤.mp3"}, {"audio": "data/audio/步练师追忆.mp3"}],
            "skills": [{"skill": "安恤", "details": "出牌阶段，你可以选择两名手牌数不相等的其他角色，令其中手牌少的角色获得手牌多的角色一张手牌并展示之，若该牌不为黑桃，你摸一张牌。每阶段限一次。"},
                {"skill": "追忆", "details": "你死亡时，可以令一名其他角色（杀死你的角色除外）摸三张牌并回复1点体力。"}
            ],
            "val": [{"attack": "72%"}, {"alive": "74%"}, {"ability": "83%"}],
            "charactor": "步练师在孙权众嫔妃中最受孙权宠爱，宫中对她礼节等同于皇后，生有二女：即全公主和朱公主。孙权称吴王，打算立步练师为王后和皇后，但朝中群臣都认为应该立太子孙登的养母徐夫人为皇后。孙权意在步氏，所以始终不接纳群臣的要求，十余年没有正式立皇后。皇后一位虽然没有给步练师，但宫内人士都称步练师为皇后，而步练师的亲戚上疏时都用中宫一词称呼步练师。",
            "feature": "步练师虽然作为辅助型武将，但她的的武将作用是非常大的。安恤是一个拉牌差的技能就算最低收益也依然会产生两张牌差，这就形成一个如同张辽一样，对方出牌要考虑手中牌的质量和数量。追忆能让她在死后依然可以帮助团队的核心或者关键点做出自己的贡献。"
        },
        {
            "name": "陆 逊", "src": "3陆逊.jpg", "id": "3", "audioSrc": [{"audio": ""}, {"audio": "data/audio/陆逊连营.mp3"}],
            "skills": [{"skill": "谦逊", "details": "锁定技，你不能成为【顺手牵羊】和【乐不思蜀】的目标。"},
                {"skill": "连营", "details": "每当你失去最后一张手牌时，可立即摸一张牌。"}
            ],
            "val": [{"attack": "72%"}, {"alive": "70%"}, {"ability": "84%"}],
            "charactor": "陆逊（字伯言），三国时期吴国政治家、军事家。203年入孙权幕府，历任海昌屯田都尉、定威校尉、帐下右部督。219年陆逊参与袭取荆州。222年孙权以陆逊为大都督，在夷陵火烧连营击败刘备，一战成名。228年陆逊取得石亭之战的胜利。229年孙权称帝后，以陆逊为上大将军、辅佐太子孙登并掌管陪都武昌事宜后卷入立嗣之争。244年拜为丞相、荆州牧、右都护、总领三公事务，领武昌事。次年去世，终年六十三岁，追谥昭侯。",
            "feature": "谦逊使得陆逊可以防止被乐被顺可以说是一个非常优秀的技能，连营在没有手牌的时候提供很高的爆发能力。但缺点很明显连营的发动频率不稳定，输出主要靠杀所以万一断杀那么他的境地就非常尴尬了。"
        },
        {
            "name": "贾 诩", "src": "4贾诩.jpg", "id": "4",
            "audioSrc": [{"audio": "data/audio/贾诩完杀.mp3"}, {"audio": "data/audio/贾诩帷幕.mp3"}, {"audio": "data/audio/贾诩乱舞.mp3"}],
            "skills": [{"skill": "完杀", "details": "锁定技，在你的回合，除你以外，只有处于濒死状态的角色才能使用【桃】。"},
                {"skill": "帷幕", "details": "锁定技，你不能成为黑桃或梅花锦囊的目标。"},
                {"skill": "乱舞", "details": "限定技，出牌阶段，可以令除你以外的所有角色依次对与其距离最近的另一名角色使用一张【杀】，无法如此做者失去1点体力。"}],
            "val": [{"attack": "84%"}, {"alive": "78%"}, {"ability": "86%"}],
            "charactor": "贾诩（字文和）东汉末年至三国初年著名谋士、军事战略家，曹魏开国功臣。原为董卓部将，董卓死后，献计李傕、郭汜反攻长安。李傕等人失败后，辗转成为张绣的谋士。张绣曾用他的计策两次打败曹操，官渡之战前他劝张绣归降曹操。官渡之战时，贾诩力主与袁绍决战。赤壁之战前，认为应安抚百姓而不应劳师动众讨江东，曹操不听，结果受到严重的挫败。曹操与关中联军相持渭南时，贾诩献离间计瓦解马超、韩遂，使得曹操一举平定关中。",
            "feature": "贾诩就好像毒士一样，没有多摸牌没有稳定输出甚至比菜刀流还要白板一点，但一个完杀随时随地取了对方团队的核心让人不得不忌惮，应该说所有主公都害怕贾诩。帷幕是个神技能，提高了贾诩的防御整个牌堆只有一张红色顺手和红色过拆所以最难搞定的就是神装的贾诩。乱舞让贾诩在关键时刻配合完杀可以取敌核心首级，就算有桃也是神仙难救！"
        },
        {
            "name": "黄月英", "src": "2黄月英.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/黄月英集智.mp3"}, {"audio": ""}],
            "skills": [{"skill": "集智", "details": "每当自己使用了一张锦囊牌,便可摸一张牌。"},
                {"skill": "奇才", "details": "使用任何锦囊牌无距离限制。"}],
            "val": [{"attack": "83%"}, {"alive": "63%"}, {"ability": "78%"}],
            "charactor": "黄月英沔阳名士黄承彦之女，诸葛亮之妻，诸葛瞻之母。本名于史无载，“月英”是她在民间传说中的名字。黄承彦以黄月英有才，向诸葛亮推荐，请求配婚，诸葛亮答应后遂与黄月英结为夫妻。相传黄月英黄头发黑皮肤，但知识广博。诸葛亮发明木牛流马，相传就是从黄月英的传授的技巧上发展出来。",
            "feature": "黄月英的有点就是依靠锦囊牌来一波爆发，可以打出很好的收益。当然缺点也很明显太脆了，血量少而且也没有防御技能特别怕被控。"

        },
        {
            "name": "诸葛恪", "src": "3诸葛恪.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/诸葛恪傲才.mp3"}, {"audio": "data/audio/诸葛恪黩武.mp3"}],
            "skills": [{"skill": "傲才", "details": "当你于回合外需要使用或打出一张基本牌时，你可以观看牌堆顶的两张牌。若你观看的牌中有此牌，你可以使用打出之。"},
                {"skill": "黩武", "details": "出牌阶段，你可以选择你攻击范围内的一名其他角色并弃置X张牌（X为该角色的体力值），然后对其造成1点伤害。若其因受到此伤害而进入濒死状态，则当此濒死结算结束后，你失去1点体力，且此技能失效，直到回合结束。"}],
            "val": [{"attack": "94%"}, {"alive": "75%"}, {"ability": "89%"}],
            "charactor": "诸葛恪（字元逊），三国时期东吴权臣，蜀汉丞相诸葛亮之侄，大将军诸葛瑾长子。葛恪体格肥胖，幼小以神童著称，成人之后拜骑都尉，孙权长子孙登为太子时担任左辅都尉，作为东宫幕僚领袖辅佐太子理政。之后历任丹阳太守、威北将军等职，丞相陆逊病逝，诸葛恪升任大将军并代领其兵。公元253年，同为托孤大臣的孙峻暗中联合吴主孙亮，将诸葛恪及其死党以赴宴为名诱入宫中，在宴会上将诸葛恪杀害，时年五十一岁。孙休即位除掉权臣孙綝之后，下诏为诸葛恪平反。",
            "feature": "诸葛恪强输出型武将黩武的强拍，让滴血量的武将很是忌惮。当然黩武的情况下自身的一个防御能力就比价低了，但傲才可以说起到了一定的保护作用。"
        },
        {
            "name": "荀 攸", "src": "1荀攸.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/荀攸奇策.mp3"}, {"audio": "data/audio/荀攸若愚.mp3"}],
            "skills": [{"skill": "奇策", "details": "出牌阶段，你可以将所有的手牌（至少一张）当做任意一张非延时性锦囊牌使用，每阶段限一次。"},
                {"skill": "若愚", "details": "每当你受到一次伤害后，你可以摸一张牌，然后展示所有手牌，若颜色均相同，伤害来源弃置一张手牌。"}],
            "val": [{"attack": "99%"}, {"alive": "77%"}, {"ability": "99%"}],
            "charactor": "荀攸（字公达），荀彧之侄，东汉末年谋士。曹操迎天子入许都之后，荀攸成为曹操的军师。 曹操征伐吕布时荀攸劝阻了曹操退兵，并献奇计水淹下邳城，活捉吕布。官渡之战荀攸献计声东击西，斩杀颜良和文丑。又策奇兵，派徐晃烧袁绍粮草，同时力主曹操接纳许攸，画策乌巢，立下大功。平定河北期间，荀攸力排众议，主张曹操消灭袁绍诸子，被曹操上奏朝廷封为陵树亭侯。荀攸行事周密低调，计谋百出，深受曹操称赞。214年，荀攸在曹操伐吴途中去世。",
            "feature": "荀攸奇策的攻击力极强，而且在己方占优的情况下可以无脑的开桃园结义（帮助队友恢复体力），关键时刻可以提供致命性的输出。唯一的缺点就是太脆但若愚起到了一定的保护作用。无论在什么样的阵容荀攸都是一个团队最稳定的输出点，但也有可能是最先被突破的点，所以荀攸的操作难度是比较高的同样收益也是非常高的。"
        },
        {
            "name": "刘 禅", "src": "2刘禅.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/刘禅享乐.mp3"}, {"audio": "data/audio/刘禅放权.mp3"}, {"audio": "data/audio/刘禅若愚.mp3"}, {"audio": "data/audio/刘禅激将.mp3"}],
            "skills": [{"skill": "享乐", "details": "锁定技，当其他角色使用【杀】指定你为目标时，需额外弃置一张基本牌，否则该【杀】对你无效。"},
                {"skill": "放权", "details": "你可以跳过你的出牌阶段，然后在回合结束时可弃置一张手牌令一名其他角色进行一个额外的回合。"},
                {"skill": "若愚", "details": "主公技，觉醒技，回合开始阶段开始时，若你的体力是全场最少的（或之一），你须加1点体力上限，回复1点体力，并获得技能“激将”。"},
                {"skill": "激将", "details": "当你需要使用（或打出）一张【杀】时，你可以发动激将。所有“蜀”势力角色按行动顺序依次选择是否打出一张【杀】（视为由你使用或打出）。"}],
            "val": [{"attack": "65%"}, {"alive": "86%"}, {"ability": "80%"}],
            "charactor": "刘禅（字公嗣），即蜀汉孝怀皇帝，又称后主,小名阿斗。蜀汉昭烈帝刘备之子，母亲是昭烈皇后甘氏，三国时期蜀汉第二位皇帝。幼年时多遭难，幸得大将赵云两次相救，刘备定益州后入蜀，蜀汉建立后被立为太子。公元223年继位为帝，在位四十二年。期间拜诸葛亮为相父，并支持姜维北伐，在位后期宠信黄皓，致使蜀汉逐渐走向衰弱。",
            "feature": "刘禅（小八神）一个辅助英雄，放权属于遇到队友强大就强大，白板就白板但总体而言刘禅的放权是个神技能。作为三血武将有一个享乐的防御技能是非常棒的，保证了自己放权之后的生存能力，比较怕锦囊之类的输出。"
        },
        {
            "name": "张 角", "src": "4张角.jpg", "id": "4",
            "audioSrc": [{"audio": "data/audio/张角雷击.mp3"}, {"audio": "data/audio/张角鬼道.mp3"}, {"audio": "data/audio/张角黄天.mp3"}],
            "skills": [{"skill": "雷击", "details": "每当你使用或打出一张【闪】时，可令一名角色判定，若结果为黑桃，你对该角色造成2点雷电伤害。"},
                {"skill": "鬼道", "details": "在一名角色的判定牌生效前，你可以用一张黑色牌替换之。"},
                {"skill": "黄天", "details": "主公技，群雄角色可以在他们各自的出牌阶段交给你一张【闪】或【闪电】，每阶段限一次。"}],
            "val": [{"attack": "86%"}, {"alive": "73%"}, {"ability": "82%"}],
            "charactor": "张角中国东汉末年农民起义军“黄巾军”的领袖，太平道的创始人。他因得到道士于吉等人所传《太平清领书》（即《太平经》），遂以宗教救世为己任，利用其中的某些宗教观念和社会政治思想，组织群众，中平元年，张角以“苍天已死，黄天当立，岁在甲子，天下大吉”为口号，率领群众发动起义，史称“黄巾起义”。不久张角病死，起义军也很快被汉朝所镇压。",
            "feature": "雷击并不是一个输出技能而是一个威慑技能，但是作为输出是个很强的存在但牌堆中，平均6张牌出一张闪。鬼道虽然没有司马懿的鬼才全面但却是个无损判定，更加重要的是配合雷击打出想要的输出。"
        },
        {
            "name": "张春华", "src": "1张春华.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/张春华绝情.mp3"}, {"audio": "data/audio/张春华伤逝.mp3"}],
            "skills": [{"skill": "绝情", "details": "锁定技，你即将造成的伤害均视为失去体力。"},
                {"skill": "伤逝", "details": "弃牌阶段外，当你的手牌数小于X时，你可以将手牌补至X张（X为你已损失的体力值且最多为2）。"}],
            "val": [{"attack": "73%"}, {"alive": "76%"}, {"ability": "75%"}],
            "charactor": "宣穆皇后张春华，曹魏粟邑令张汪之女，晋宣帝司马懿之妻，晋景帝司马师和晋文帝司马昭的母亲。正始八年（247年），张春华去世，时年五十九岁，葬于洛阳高原陵，追赠广平县君。泰始元年（265年），张春华之孙晋武帝司马炎登基，追谥她为宣穆皇后。",
            "feature": "绝情可以说是完全克制魏国卖血流的一个技能，犹如姜维的挑衅一样。伤逝又有点像陆逊的连营，在低血量的情况下容易打出输出但并不稳定而且无法收人头。总体而言强度属于中等。"
        },
        {
            "name": "孙 策", "src": "3孙策.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/孙策激昂.mp3"}, {"audio": "data/audio/孙策魂姿.mp3"}, {"audio": "data/audio/孙策制霸.mp3"}, {"audio": "data/audio/孙策英魂.mp3"}, {"audio": "data/audio/孙策英姿.mp3"}],
            "skills": [{"skill": "激昂", "details": "每当你使用（指定目标后）或被使用（成为目标后）一张【决斗】或红色【杀】时，你可以摸一张牌。"},
                {"skill": "魂姿", "details": "觉醒技，回合开始阶段开始时，若你的体力为1，你须减1点体力上限，并获得技能“英姿”和“英魂”。"},
                {"skill": "制霸", "details": "主公技，其他吴势力角色的出牌阶段，可与你拼点，若该角色没赢，你可以获得双方拼点的牌，每阶段限一次；“魂姿”发动后，你可以拒绝此拼点。"},
                {"skill": "英魂", "details": "回合开始阶段开始时，若你已受伤，可令一名其他角色执行一项： 摸X张牌，然后弃一张牌；或摸一张牌，然后弃X张牌（X为你已损失的体力值）。"},
                {"skill": "英姿", "details": "摸牌阶段，你可以额外摸一张牌。"}],
            "val": [{"attack": "75%"}, {"alive": "80%"}, {"ability": "85%"}],
            "charactor": "孙策（字伯符）破虏将军孙坚长子、吴大帝孙权长兄。东汉末年割据江东一带的军阀，汉末群雄之一，三国时期孙吴的奠基者之一。《三国演义》称其武勇犹如霸王项羽，绰号“小霸王”。建安五年（200年）4月，正当孙策准备发兵北上之时，在丹徒狩猎中为刺客所伤，不久后身亡，年仅二十六岁。其弟孙权接掌孙策势力，并于称帝后，追谥孙策为长沙桓王。",
            "feature": "孙策在没有觉醒之前被称为江东小白板，但是觉醒之后完全是一个非常强且全能的武将不仅通过英魂来拉牌差，而且英姿和激昂提供一个小的过牌量，但从孙策实战来说他的发挥是比较有限的；小技巧：孙策为主公，可先消灭忠臣（与其他主公的套路都不一样），因为在其未觉醒之前都是比较白板且作用较低。"
        },
        {
            "name": "关 羽", "src": "2关羽.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/关羽武圣.mp3"}],
            "skills": [{"skill": "武圣", "details": "任何时候使用,可将自己的红色花色牌(包括红桃和方块)当[杀]使用。"}],
            "val": [{"attack": "83%"}, {"alive": "80%"}, {"ability": "75%"}],
            "charactor": "关羽（字云长），东汉末年名将，早期跟随刘备辗转各地，曾被曹操生擒，于白马坡斩杀袁绍大将颜良，与张飞一同被称为万人敌。关羽去世后，逐渐被神化，被民间尊为“关公”，又称美髯公。历代朝廷多有褒封，清代奉为“忠义神武灵佑仁勇威显关圣大帝”，崇为“武圣”，与“文圣” 孔子齐名。《三国演义》尊其为蜀国“五虎上将”之首，毛宗岗称其为“《演义》三绝”之“义绝”。",
            "feature": "蜀国多菜刀流武将，很多情况下都是缺杀的但关羽的武圣让他不缺杀。但同样受困于菜刀流的软肋，攻击距离的一个限制。"
        },
        {
            "name": "钟 会", "src": "1钟会.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/钟会权计.mp3"}, {"audio": "data/audio/钟会自立.mp3"}, {"audio": "data/audio/钟会排异.mp3"}],
            "skills": [{"skill": "权计", "details": "每当你受到1点伤害后，你可以摸一张牌，然后将一张手牌置于你的武将牌上，称为“权”；锁定技，你的手牌上限+X（X为“权”的数量）。"},
                {"skill": "自立", "details": "觉醒技，准备阶段开始时，若“权”的张数不小于3，你减1点体力上限，选择一项：1.回复1点体力；2.摸两张牌。然后你获得“排异”。"},
                {"skill": "排异", "details": "出牌阶段限一次，你可将一张“权”置入弃牌堆并选择一名角色，令其摸两张牌，然后若其手牌多于你，你对其造成1点伤害。"}],
            "val": [{"attack": "78%"}, {"alive": "80%"}, {"ability": "83%"}],
            "charactor": "钟会（字士季），魏太傅钟繇之幼子、青州刺史钟毓之弟。他在魏国官居要职，是三国后期 魏国重要的策臣与谋士、制定伐蜀计划并参与灭蜀之战的智将。同时也是一位书法家。魏灭蜀之战，钟会与邓艾分兵攻打蜀汉，导致蜀汉灭亡。此后钟会与蜀汉降将姜维共谋，欲据蜀自立，遂打压原同僚邓艾，并且图谋反叛，矫诏起兵 以郭太后遗命之名 讨伐司马昭。却因部下的兵变而失败，自己也死于乱军，时年40岁。",
            "feature": "山包武将都有打后期的能力，打的越慢越好。钟会就属于这一种每一个权都给他提供手牌上限，一对一的情况下钟会是非常强的，但缺点就是输出乏力。作为内奸是比较合适的。"
        },
        {
            "name": "张 郃", "src": "1张郃.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/张郃巧变.mp3"}],
            "skills": [{"skill": "巧变", "details": "你可以弃置一张手牌跳过你的一个阶段（回合开始阶段和回合结束阶段除外）；若以此法跳过摸牌阶段，你获得其他至多两名角色各一张手牌；若以此法跳过出牌阶段，你可以将场上的一张牌移动到另一名角色区域里的相应位置。"}],
            "val": [{"attack": "76%"}, {"alive": "85%"}, {"ability": "90%"}],
            "charactor": "张郃（字儁乂），三国时期魏国名将，以用兵巧变、善列营阵，长于利用地形著称，与张辽、曹仁、夏候渊、徐晃并称曹操手下五子良将。东汉末年，张郃应募参加镇压黄巾起义，后属冀州牧韩馥为军司马。191年，袁绍取冀州，张郃率兵投归，任校尉。因破公孙瓒有功，迁为宁国中郎将，在官渡之战中投降曹操。随曹操攻乌桓、破马超、降张鲁，屡建战功。215年，率军进攻巴西宕渠，被蜀将张飞击败。219年，从夏侯渊迎战刘备军于定军山，当夏侯渊战死，全军危急之际，张郃代帅，率部安全撤退。曹丕称帝后，升张郃为左将军，封鄚侯，奉命从曹真击平安定羌胡，后与夏侯尚围攻江陵。228年，随曹真西拒诸葛亮，在街亭大败蜀军，231年，领兵追击蜀军，至木门中箭亡。",
            "feature": "张郃（小八神）比张辽更加优秀，都是辅助控制型武将，张郃不仅限制对手的手牌还可以将场上的装备，控制类锦囊都可以移动，对团队而言是非常优秀的。唯一的缺点和张辽一样就是缺乏输出。"
        },
        {
            "name": "关 平", "src": "2关平.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/关平龙吟.mp3"}],
            "skills": [{"skill": "龙吟", "details": "每当一名角色在其出牌阶段使用杀时，你可弃置一张牌令此杀不计入出牌阶段使用次数，若此杀为红色，你摸一张牌。"}],
            "val": [{"attack": "76%"}, {"alive": "78%"}, {"ability": "72%"}],
            "charactor": "关平（生卒年不详），东汉末年名将关羽之子，关羽率军攻打樊城时，孙权借机征讨荆州。关平与其父一同被擒，最后被斩于临沮县。",
            "feature": "关平等于给每一个队友都加装了一个连弩，但对手牌的消耗是比较大的，最好配合的就是关羽只要他有杀，关平可以无止境的过牌。"
        },
        {
            "name": "陈 宫", "src": "4陈宫.jpg", "id": "4",
            "audioSrc": [{"audio": "data/audio/陈宫明策.mp3"}, {"audio": "data/audio/陈宫智迟.mp3"}],
            "skills": [{"skill": "明策", "details": "出牌阶段，你可以交给任一其他角色一张装备牌或【杀】，该角色进行二选一：1. 视为对其攻击范围内的另一名由你指定的角色使用一张【杀】。2. 摸一张牌。每回合限一次。"},
                {"skill": "智迟", "details": "锁定技，你的回合外，你每受到一次伤害，任何【杀】或非延时类锦囊均对你无效，直到该回合结束。"}],
            "val": [{"attack": "87%"}, {"alive": "76%"}, {"ability": "87%"}],
            "charactor": "陈宫（字公台），东汉末年吕布帐下首席谋士，。性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。",
            "feature": "陈宫（小八神）应该是菜刀流武将的最爱，不仅可以让武将成为二刀流也可以为他们提供所需的距离。虽然是三血但是智迟是个非常优秀的防御技能，保证了陈宫的存活能力。"
        },
        {
            "name": "荀 彧", "src": "1荀彧.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/荀彧驱虎.mp3"}, {"audio": "data/audio/荀彧节命.mp3"}],
            "skills": [{"skill": "驱虎", "details": "出牌阶段，你可以与一名体力比你多的角色拼点，若你赢，则该角色对其攻击范围内你指定的另一名角色造成1点伤害。若你没赢，则其对你造成1点伤害。每阶段限一次。"},
                {"skill": "节命", "details": "每当你受到1点伤害后，可令一名角色将手牌补至等同于其体力上限的张数（最多补至五张）。"}],
            "val": [{"attack": "93%"}, {"alive": "83%"}, {"ability": "95%"}],
            "charactor": "荀彧（字文若）。东汉末年著名政治家、战略家，曹操统一北方的首席谋臣和功臣。荀彧早年被称为“王佐之才”，初举孝廉，任守宫令。后弃官归乡，又率宗族避难冀州，被袁绍待为上宾。其后投奔曹操。因其任尚书令，居中持重达十数年，处理军国事务，被人敬称为“荀令君”。后因反对曹操称魏公而受曹操所忌，调离中枢，在寿春忧郁成病而亡（一说服毒自尽），年五十。获谥敬侯，后追赠太尉。",
            "feature": "荀彧（八神）可是说是郭嘉的加强版，都是卖血流武将，节命的收益要大于遗计。但郭嘉只能被动的卖血，而文若的驱虎可以选择主动卖血还是打输出。应该说这两个技能配合的天衣无缝。文若无论到哪儿都可以成为团队的核心，也是对手集火的对象但节命的存在又让对手会有很多顾虑。"
        },
        {
            "name": "小 乔", "src": "3小乔.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/小乔天香.mp3"}, {"audio": "data/audio/小乔红颜.mp3"}],
            "skills": [{"skill": "天香", "details": "每当你受到伤害时，你可以弃置一张红桃手牌来转移此伤害给一名其他角色，然后该角色摸X张牌（X为该角色当前已损失的体力值）。"},
                {"skill": "红颜", "details": "锁定技，你的黑桃牌均视为红桃牌。"}],
            "val": [{"attack": "70%"}, {"alive": "67%"}, {"ability": "68%"}],
            "charactor": "小桥，本姓桥（小乔为后世误传），中国东汉末年时期的美女。桥公的次女，汉末名将周瑜之妾。周瑜风度翩翩的才子形象，与堪称国色的小桥可称天作之合，由此成为后世文艺作品的对象。唐代著名诗人杜牧激发想象，一句“东风不与周郎便，铜雀春深锁二乔“将小桥与赤壁之战联系起来。而令“”二桥“”闻名于世。",
            "feature": "小乔整体感觉偏弱，可能在特定的局会有表现。算是一个功能性的武将，看情况用天香输出或者助攻。红颜可以让她免去很多控制和伤害。"
        },
        {
            "name": "满 宠", "src": "1满宠.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/满宠峻刑.mp3"}, {"audio": "data/audio/满宠御策.mp3"}],
            "skills": [{"skill": "峻刑", "details": "出牌阶段限一次，你可以弃置至少一张手牌并选择一名其他角色，该角色需弃置一张与你弃置的牌类别均不同的手牌，否则其先将其武将牌翻面再摸X张牌（X为你以此法弃置的手牌数量）。"},
                {"skill": "御策", "details": "每当你受到伤害后，你可以展示一张手牌，来源需弃置一张与此牌类别不同的手牌，否则你回复1点体力。"}],
            "val": [{"attack": "79%"}, {"alive": "87%"}, {"ability": "84%"}],
            "charactor": "满宠（字伯宁），三国时期魏国名将。最初在曹操手下任许县县令，掌管司法，以执法严格著称；转任汝南太守，开始参与军事，曾参与赤壁之战。后关羽围攻樊城，满宠协助曹仁守城，劝阻了弃城而逃的计划，成功坚持到援军到来。曹丕在位期间，满宠驻扎在新野，负责荆州侧的对吴作战。曹叡在位期间，满宠转任到扬州，接替曹休负责东侧对吴作战，屡有功劳。后因年迈调回中央任太尉，数年后病逝，谥号景侯。",
            "feature": "满宠两个技能都是非常好的神级技能，峻刑提供强控制，御策保证了他的生存能力，在团队中有非常明确的定位，总体强度属于中上。"
        },
        {
            "name": "祝 融", "src": "2祝融.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/祝融巨象.mp3"}, {"audio": "data/audio/祝融烈刃.mp3"}],
            "skills": [{"skill": "巨象", "details": "锁定技，【南蛮入侵】对你无效；若其他角色使用的【南蛮入侵】在结算后置入弃牌堆，你获得之。"},
                {"skill": "烈刃", "details": "每当你使用【杀】对目标角色造成一次伤害后，可与其拼点：若你赢，你获得该角色的一张牌。"}],
            "val": [{"attack": "83%"}, {"alive": "78%"}, {"ability": "75%"}],
            "charactor": "祝融是南蛮王孟获之妻，南蛮王孟获将会紧跟着她随后到来。她武艺高强，善使飞刀，百发百中，是《三国演义》中写到的唯一真正上过战场的女性。",
            "feature": "祝融是唯一个四血女性武将完美的诠释了什么是女汉纸！巨象一个优秀的技能，让祝融有收全场或者打出必要输出的能力，烈刃可以算是一个追杀技能破坏对手手牌。"
        },
        {
            "name": "邓 艾", "src": "1邓艾.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/邓艾屯田.mp3"}, {"audio": "data/audio/邓艾凿险.mp3"}, {"audio": "data/audio/邓艾急袭.mp3"}],
            "skills": [{"skill": "屯田", "details": "你的回合外，每当失去牌时，可进行一次判定，将非红桃结果的判定牌置于你的武将牌上，称为“田”：每有一张“田”，你计算与其他角色的距离便-1。"},
                {"skill": "凿险", "details": "觉醒技，回合开始阶段开始时，若“田”的数量达到3或更多，你须减1点体力上限，并获得技能“急袭”。"},
                {"skill": "急袭", "details": "出牌阶段，你可以将一张“田”当【顺手牵羊】使用。"}],
            "val": [{"attack": "70%"}, {"alive": "80%"}, {"ability": "70%"}],
            "charactor": "邓艾（字士载）三国时期魏国杰出的军事家、将领。其人文武全才，深谙兵法，对内政也颇有建树。本名邓范，后因与同乡人同名而改名。邓艾多年在曹魏西边战线防备蜀汉姜维。公元263年他与钟会分别率军攻打蜀汉，最后他率先进入成都，使得蜀汉灭亡。后因遭到钟会的污蔑和陷害，被司马昭猜忌而被收押，最后与其子邓忠一起被卫瓘派遣的武将田续所杀害。他被推崇为古今六十四名将之一。",
            "feature": "邓艾（邓白板）一个觉醒武将看上去很强，但是实战下更像个白板就算是觉醒的情况下仍然是个白板，钟会起码还可以通过权多摸牌和加上限，但邓艾顺手一般无法顺到好的手牌基本上都是一堆闪武器或者其他基本牌。"
        },
        {
            "name": "郭 嘉", "src": "1郭嘉.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/郭嘉天妒.mp3"}, {"audio": "data/audio/郭嘉遗计.mp3"}],
            "skills": [{"skill": "天妒", "details": "在你的判定牌生效后，你可以立即获得它。"},
                {"skill": "遗计", "details": "你每受到1点伤害，可摸两张牌，将其中的一张交给任意一名角色，然后将另一张交给任意一名角色。"}],
            "val": [{"attack": "64%"}, {"alive": "79%"}, {"ability": "70%"}],
            "charactor": "郭嘉（字奉孝）原为袁绍部下，后转投曹操，为曹操统一中国北方立下了功勋，官至军师祭酒，封洧阳亭侯。在曹操征伐乌丸时病逝，年仅三十八岁。谥曰贞侯。史书上称他“才策谋略，世之奇士”。曹操称赞他见识过人，是自己的“奇佐”。",
            "feature": "郭嘉属于典型的魏国卖血流的特性，天妒算是一个多摸牌的技能虽然没有周瑜英姿那么稳定但聊胜于无嘛。遗计也是一个负嘲讽的一个技能，每次受伤多摸牌为下一轮出牌提供续爆的能力同时也可以为队友补充手牌。"
        },
        {
            "name": "大 乔", "src": "3大乔.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/大乔国色.mp3"}, {"audio": "data/audio/大乔流离.mp3"}],
            "skills": [{"skill": "国色", "details": "出牌阶段，可将任意方片花色的牌当乐不思蜀使用。"},
                {"skill": "流离", "details": "任何时候，受到杀的攻击时(不包括决斗中)，可弃一张牌，将这张杀的攻击对象转移给自己攻击范围内的另一名玩家（这名玩家不得是攻击者本身）。"}],
            "val": [{"attack": "70%"}, {"alive": "82%"}, {"ability": "81%"}],
            "charactor": "大乔（乔字古作“桥”），中国东汉末三国时期的女性，系乔公之女、孙策之妾、小乔之姊。在中国长篇古典名著《三国演义》也有提及。与小乔并称为“江东二乔”，传说为绝世美女。",
            "feature": "大乔典型的辅助型武将，她的控制是最主动且最多的。但是方片一般都是闪，所以流离很好的弥补了她的这一个弱点。她会是一个团队的最优秀的控制点，特别是在人数少的情况下，大乔的作用更加明显。"
        },
        {
            "name": "鲁 肃", "src": "3鲁肃.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/鲁肃好施.mp3"}, {"audio": "data/audio/鲁肃缔盟.mp3"}],
            "skills": [{"skill": "好施", "details": "摸牌阶段摸牌时，你可以额外摸两张牌，若此时你的手牌多于五张，则将一半（向下取整）的手牌交给场上手牌数最少的一名其他角色。"},
                {"skill": "缔盟", "details": "出牌阶段，你可以选择两名其他角色，你弃置等同于这两名角色手牌数差的牌，然后交换他们的手牌。每阶段限一次。"}],
            "val": [{"attack": "83%"}, {"alive": "55%"}, {"ability": "95%"}],
            "charactor": "鲁肃（字子敬）中国东汉末年杰出战略家、外交家。出生于一士族家庭；幼年丧父，由祖母抚养长大。他体貌魁伟，性格豪爽，喜读书、好骑射。东汉末年，他眼见朝廷昏庸，官吏腐败，社会动荡，常召集乡里青少年练兵习武。他还仗义疏财，深得乡人敬慕。建安二年，鲁肃率领部属投奔孙权，为其提出鼎足江东的战略规划，因此得到孙权的赏识。建安十三年，曹操率大军南下。孙权部下多主降，而鲁肃与周瑜力排众议，坚决主战。结果，孙、刘联军大败曹军于赤壁，从此，奠定了三国鼎立格局。",
            "feature": "鲁肃（小八神）和荀彧一样都可成为团队的核心，非常强。但相比荀彧，他的生存能力是一个很大的问题。因为他太嘲讽了，破坏别人的手牌，那对手会让你多活一秒么？可以说大师多活一轮，都是收益真的是分分钟几百万上下的哟！"
        },
        {
            "name": "孙权", "src": "3孙权.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/孙权制衡.mp3"}, {"audio": "data/audio/孙权救援.mp3"}],
            "skills": [{"skill": "制衡", "details": "出牌阶段,可弃掉自己任意数量的牌,并从牌堆补回等量的牌;每回合限用一次。"},
                {"skill": "救援", "details": "主公技，锁定技，（其他）“吴”势力角色在你濒死状态下对你使用【桃】时，你额外回复1点体力。"}],
            "val": [{"attack": "91%"}, {"alive": "83%"}, {"ability": "94%"}],
            "charactor": "吴太祖大皇帝孙权（字仲谋），三国时代东吴的建立者。孙权的父亲孙坚和兄长孙策，在东汉末年群雄割据中打下了江东基业。孙策遇刺身亡，孙权继之掌事，成为一方诸侯。与刘备建立孙刘联盟，并于赤壁之战中击败曹操，奠定三国鼎立的基础。孙权被魏文帝曹丕册封为吴王，建立吴国。孙权称帝后，设置农官，实行屯田，设置郡县，并继续剿抚山越，促进了江南经济的发展。孙权派卫温、诸葛直到达夷州。孙权晚年在继承人问题上反复无常，引致群下党争，朝局不稳。252年病逝，享年七十一岁，谥号大皇帝，庙号太祖，葬于蒋陵。是三国时代统治者中最长寿的。",
            "feature": "孙权（八神）毋庸置疑单挑王，只有姜维有能力和他有50上下的胜率。制衡的大过牌量几乎让他可以单技能驰骋天下，但孙权唯一怕的是控制（乐不思蜀，兵粮寸断）。"
        },
        {
            "name": "司马懿", "src": "1司马懿.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/司马懿反馈.mp3"}, {"audio": "data/audio/司马懿鬼才.mp3"}],
            "skills": [{"skill": "反馈", "details": "你可以立即从对你造成伤害的来源处获得一张牌。"},
                {"skill": "鬼才", "details": "在任意角色的判定牌生效前，你可以打出一张手牌代替之。"}],
            "val": [{"attack": "60%"}, {"alive": "72%"}, {"ability": "75%"}],
            "charactor": "司马懿（字仲达），三国时期魏国杰出的政治家、军事家、战略家，西晋王朝的奠基人。司马懿曾任曹魏的大都督、大将军、太尉、太傅，是辅佐了魏国三代的托孤辅政之重臣，后期成为掌控魏国朝政的权臣。善谋奇策，多次征伐有功，其中最显著的功绩是两次率大军成功抵御诸葛亮北伐和远征平定辽东。对屯田、水利等农耕经济发展有重要贡献。73岁去世，辞郡公和殊礼，葬于首阳山。谥号宣文；次子司马昭封晋王后，追封司马懿为宣王；司马炎称帝后，追尊司马懿为宣皇帝，庙号高祖。",
            "feature": "司马懿的鬼才可以改很多判定牌特别是闪电和乐不思蜀等控制性锦囊，反馈让司马有了一定的负嘲讽。但确定也很明显没有输出能力，作为团队的辅助是很合格的。"
        },
        {
            "name": "黄 忠", "src": "2黄忠.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/黄忠烈弓.mp3"}],
            "skills": [{"skill": "烈弓", "details": "出牌阶段，当你使用【杀】指定一名角色为目标后，以下两种情况，你可以令此【杀】不可被【闪】响应：1. 目标角色的手牌数大于或等于你的体力值；2. 目标角色的手牌数小于或等于你的攻击范围。"}],
            "val": [{"attack": "91%"}, {"alive": "80%"}, {"ability": "76%"}],
            "charactor": "黄忠（字汉升）。本为刘表部下中郎将，后归刘备，并助刘备攻益州刘璋。黄忠在定军山一战中阵斩曹操部下名将夏侯渊，升任征西将军，刘备称汉中王后改封后将军，赐关内侯。次年，黄忠病逝。黄忠在后世多以勇猛的老将形象出现于各类文学艺术作品中，《三国演义》里，刘备称汉中王后将其封为五虎上将之一，而黄忠的名字在中国也逐渐成为了老当益壮的代名词。",
            "feature": "只要黄忠有杀那就是稳稳的输出点，当你体验过手里明明有闪不能用以及看到他出杀的恐惧之后就会明白黄忠强中是多么的可怕。"
        },
        {
            "name": "张 辽", "src": "1张辽.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/张辽突袭.mp3"}],
            "skills": [{"skill": "突袭", "details": "摸牌阶段，你可以放弃摸牌，然后从至多两名（至少一名）角色的手牌里各随机获得一张牌。"}],
            "val": [{"attack": "78%"}, {"alive": "87%"}, {"ability": "83%"}],
            "charactor": "张辽（字文远），汉末三国时期曹魏名将。曾从属丁原、董卓、吕布。吕布下邳败亡后，归顺曹操。此后随曹操四处征讨，战功累累。濡须之战后，张辽与李典、乐进等镇守合肥，并多次击退孙吴的进攻，合肥之战，张辽率800将士冲击孙权的十万大军，打到了孙权的主帅旗下，令孙权闻风丧胆，吴军披靡溃败。后以七千之众大破十万大军，差点活捉孙权。经此一役，张辽威震江东，声名大噪，“张辽止啼”也成为民间流传的传奇典故。",
            "feature": "张辽（八神）虽然缺乏一点输出但是突袭的控制能力让对手不得不考虑自己手牌的构造，无论怎么样每回合都可以提供非常强的控制能力。"
        },
        {
            "name": "赵 云", "src": "2赵云.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/赵云龙胆.mp3"}],
            "skills": [{"skill": "龙胆", "details": "任何时候,可以将手牌中的[杀]当[闪]、[闪]当[杀]使用。"}],
            "val": [{"attack": "82%"}, {"alive": "82%"}, {"ability": "75%"}],
            "charactor": "赵云（字子龙）。身长八尺，姿颜雄伟，三国时期蜀汉名将。赵云受本郡推举，率领义从加入白马将军公孙瓒。期间结识了汉室皇亲刘备，但不久之后，赵云因为兄长去世而离开。赵云离开公孙瓒大约七年后，在邺城与刘备相见，从此追随刘备。赵云跟随刘备将近三十年，先后参加过博望坡之战、长坂坡之战、江南平定战，独自指挥过入川之战、汉水之战、箕谷之战，都取得了非常好的战果。去世后被追谥为“顺平候”，以“常胜将军”的形象在民间广为流传。",
            "feature": "赵云比较全面既不会像别人那样却闪，也不会像蜀将那样却杀。比较中规中矩吧。"
        },
        {
            "name": "太史慈", "src": "3太史慈.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/太史慈天义.mp3"}],
            "skills": [{"skill": "天义", "details": "出牌阶段，你可以与一名其他角色拼点。若你赢，你获得以下技能直到回合结束：你使用【杀】时无距离限制；可额外使用一张【杀】；使用【杀】时可额外指定一个目标。若你没赢，你不能使用【杀】，直到回合结束。每阶段限一次。"}],
            "val": [{"attack": "97%"}, {"alive": "78%"}, {"ability": "88%"}],
            "charactor": "太史慈（字子义）弓马熟练，箭法精良。原为刘繇部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。太史慈逝世，死前说道：“丈夫生世，当带三尺之剑，以升天子之阶。今所志未从，奈何而死乎！”（《吴书》，《三国演义》为“大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！”）言讫而亡，年四十一岁。",
            "feature": "太史慈（小八神）一旦天义成功且手中有杀的话，那么这一轮可以打出四张杀的效果，攻击力是报表的！而且他素有武器之神的美誉。"
        },
        {
            "name": "吴国太", "src": "3吴国太.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/吴国太甘露.mp3"}, {"audio": "data/audio/吴国太补益.mp3"}],
            "skills": [{"skill": "甘露", "details": "出牌阶段，你可以选择两名角色，交换他们装备区里的所有牌。以此法交换的装备数差不能超过X(X为你已损失体力值)。每回合限一次。"},
                {"skill": "补益", "details": "当有角色进入濒死状态时，你可以展示该角色的一张手牌：若此牌不为基本牌，则该角色弃掉这张牌并回复1点体力。"}],
            "val": [{"attack": "70%"}, {"alive": "84%"}, {"ability": "75%"}],
            "charactor": "吴国太，小说《三国演义》中的人物，不见于正史记载。在小说中，吴国太被描述为孙坚的次妻，孙坚正妻武烈皇后（小说中写作吴太夫人）的妹妹，孙朗、孙仁的母亲，原型是孙坚之妾丁氏。",
            "feature": "吴国太作为团队的辅助是很合适的，不仅控制着场上的装备，同时也可以在危急时刻救护队友保证生存。"
        },
        {
            "name": "诸葛亮", "src": "2诸葛亮.jpg", "id": "2",
            "audioSrc": [{"audio": "data/audio/诸葛亮观星.mp3"}, {"audio": "data/audio/诸葛亮空城.mp3"}],
            "skills": [{"skill": "观星", "details": "自己回合开始前,可查看牌堆顶的三张牌,将其中任意数量的牌以任意顺序置于牌堆底,其余则以任意顺序置于牌堆顶。"},
                {"skill": "空城", "details": "锁定技，当你没有手牌时，你不能成为【杀】或决斗的目标。"}],
            "val": [{"attack": "83%"}, {"alive": "78%"}, {"ability": "87%"}],
            "charactor": "诸葛亮（字孔明）号卧龙（也作伏龙），三国时期蜀汉丞相，杰出的政治家、军事家、外交家、散文家、书法家、发明家、文学家。早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中耕种。 后刘备三顾茅庐请出，辅佐刘备建立蜀汉。诸葛亮一生“鞠躬尽瘁、死而后已”，是中国传统文化中忠臣与智者的代表人物。",
            "feature": "诸葛亮的限制能力以及稳定的过牌量也是让他成为强将的一个因素，观星不仅加大过牌防控限制还可以下家的手牌，空城是个非常强的防御技能基本上只有aoe才能伤害诸葛。"
        },
        {
            "name": "张昭张纮", "src": "3二张.jpg", "id": "3",
            "audioSrc": [{"audio": "data/audio/二张直谏.mp3"}, {"audio": "data/audio/二张固政.mp3"}],
            "skills": [{"skill": "直谏", "details": "出牌阶段，你可以将手牌中的一张装备牌置于一名其他角色装备区里，然后摸一张牌。"},
                {"skill": "固政", "details": "其他角色的弃牌阶段结束时，你可将此阶段中弃置的一张牌从弃牌堆返回该角色手牌，然后你可以获得弃牌堆里其余于此阶段中弃置的牌。"}],
            "val": [{"attack": "80%"}, {"alive": "80%"}, {"ability": "86%"}],
            "charactor": "张昭（字子布）三国时期孙吴重臣。张昭善隶书，其作品无存。张纮（字子纲）东汉末年文学家、谋士，和张昭一起合称“二张”。孙策平定江东时亲自登门邀请，张纮遂出仕为官。张纮被派遣至许都，任命侍御史。但孙权继位时张纮又返回江东，任长史之职。张纮后来建议孙权迁都秣陵，孙权正在准备时张纮病逝，其年六十岁。",
            "feature": "二张可以让所有队友都手牌上限加一，并且只要有弃牌那么他的防御他手牌质量都会有一个上升。作为团队的核心是非常不错。"
        },
        {
            "name": "曹 植", "src": "1曹植.jpg", "id": "1",
            "audioSrc": [{"audio": "data/audio/曹植落英.mp3"}, {"audio": "data/audio/曹植酒诗.mp3"}],
            "skills": [{"skill": "落英", "details": "当其他角色的梅花牌，因弃牌或判定而进入弃牌堆时，你可以获得之。"},
                {"skill": "酒诗", "details": "若你的武将牌正面朝上，你可以(在合理的时机)将你的武将牌翻面来视为使用一张【酒】;当你的武将牌背面朝上时你受到伤害，你可在伤害结算后将之翻回正面。"}],
            "val": [{"attack": "89%"}, {"alive": "83%"}, {"ability": "81%"}],
            "charactor": "曹植（字子建）是曹操与武宣卞皇后所生第三子，生前曾为陈王，去世后谥号“思”，因此又称陈思王。曹植是三国时期曹魏著名文学家，作为建安文学的代表人物之一与集大成者，他在两晋南北朝时期，被推尊到文章典范的地位。其代表作有《洛神赋》、《白马篇》《七哀诗》等。后人因其文学上的造诣而将他与曹操、曹丕合称为“三曹”。",
            "feature": "曹植是不缺杀的武将，杀主要是以梅花居多所以一旦进入弃牌那么曹植就可以获得更加重要的是牌堆里有一张梅花连弩，虽然是三血但曹植的生存能力因为有酒诗而很强这个技能不仅可以保命也可以加大伤害输出！"
        }
    ]

    var $ulPage = $('#ulpage'),
        lis = $ulPage.children(),
        pageId,
        $rowList = $('.rowList');
    //初始化列表加载
    pageId = store.get('pageId');//存储的值需要赋值给pageId
    if(pageId == undefined){
        pageId = 1;
        $(lis).removeClass('active');
        $(lis[pageId - 1]).addClass('active');
        var cutArr = cut(pageId);

        pageData(cutArr);
    }else{
        pageId = store.get('pageId');
        $(lis).removeClass('active');
        $(lis[pageId - 1]).addClass('active');
        var cutArr = cut(pageId);

        pageData(cutArr);
    }
    //分页按钮事件
    $ulPage.on('click', 'li', function(e){
        $('#ulpage li').removeClass('active');
        var curLi = $(e.target);
        curLi.parent().addClass('active');

        pageId = curLi.data('id');
        store.set('pageId', pageId);

        var cutArr = cut(pageId);

        pageData(cutArr);
        e.preventDefault;
    });

    //左侧栏li切换事件
    $('.nav-sidebar').on('click', 'li', function(){
        if($(this).hasClass('sideactive')){
            return;
        }else{
            $('li').removeClass('sideactive');
            $(this).addClass('sideactive');
            change(this);
        }
    });
    //横向滚动条切换事件
    $('.navbar-nav').on('click', 'li', function(){
        change(this);
    });
    //展示模块切换函数
    function change(thisObj){
        var curIndex = $(thisObj).attr('data-index');
        console.log(curIndex);
        if(curIndex == 3){
            return;
        }else{
            $('.mod').fadeOut(300);
            $('.mod_'+curIndex).fadeIn(300);
            if($('.navList').is(':visible')){
                $('.nav-info').hide();
                $('.navList').hide();
            }
        }
    }

    //武将详情信息弹出框
    $(document).on('click', '.list-item .btn-primary', function(e){
        var $listBtn = $('.list-item .btn-primary');
        for(var i=0;i<$listBtn.length;i++){
            $listBtn[i].index = i;
        }
        var that = this.index;
        var dataArr = cut(pageId);
        alertInfo(dataArr, that);
        //$.get("data/page"+ pageId +".json", function(data){
        //    alertInfo(data, that);
        //});
        e.stopPropagation();
    });

    //弹出信息函数
    function alertInfo(data, that){
        var $listRowInfo = $('.listRow').find('.col-md-4'),
            $panelBody = $('.panel-body'),
            $character = $('.character').find('p'),
            $feature = $('.feature').find('p');
        var html = alertSkill(data[that]);

        $('.nav-info').show();
        $listRowInfo.html('');
        $listRowInfo.html(html);

        $panelBody.find('.progress-bar-danger').css("width", data[that].val[0].attack);
        $panelBody.find('.progress-bar-success').css("width", data[that].val[1].alive);
        $panelBody.find('.progress-bar-info').css("width", data[that].val[2].ability);

        $character.html('');
        $character.html(data[that].charactor);

        $feature.html('');
        $feature.html(data[that].feature);
    }
    //弹出框关闭事件
    $('.navList').find('.close').click(function(){
        $('.nav-info').hide();
    });
    //音频播放事件
    $(document).on('click', '.media-botn .btn', function(){
        this.lastChild.play();
    });

    //弹出框更新函数
    function alertSkill(data){
        var str = '';
        var html =
            '<div class="info-img">' +
            '<img src="img/'+ data.src +'" alt="">' +
            '</div>';
        for(var i=0;i<data.skills.length;i++){
            str += '<div class="media media-botn">'+
                '<div class="media-left">' +
                '<button class="btn btn-default btn-xs" >' +
                ''+ data.skills[i].skill +' &nbsp;<span class="glyphicon glyphicon-volume-down" aria-hidden="true"></span>' +
                '<audio controls="controls" clas="audio"><source src="'+ data.audioSrc[i].audio +'" type="audio/mp3"></audio>' +
                '</button></div>'+
                '<div class="media-body">'+
                '<span>'+ data.skills[i].details +'</span>' +
                '</div></div>';
        }
        html += str;
        return html;
    }

    //代替异步请求函数
    function pageData(data){
        //console.log(data);
        var $list = "";
        for(var i=0;i<data.length;i++){
            $list += '<div class="col-xs-6 col-md-3">' +
                '<div class="thumbnail list-item item-nation'+ data[i].id +'">' +
                '<div><img src="img/' + data[i].src + '" alt="...">' +
                '<h4><a href="javascript:;" class="btn btn-primary btn'+ data[i].id +'" role="button">' + data[i].name + '</a></h4>' +
                '</div></div></div>';
        }
        $rowList.html("");
        $rowList.html($list);
    }
    //截取数组函数
    function cut(pageId){
        var arr = '';
        switch (pageId){
            case pageId = 1:
                arr = arrData.slice(0, 8);
                break;
            case pageId = 2:
                arr = arrData.slice(8, 16);
                break;
            case pageId = 3:
                arr = arrData.slice(16, 24);
                break;
            case pageId = 4:
                arr = arrData.slice(24, 32);
                break;
            case pageId = 5:
                arr = arrData.slice(32, arrData.length);
                break;
        }
        console.log(arr);
        return arr;
    }

    //站内搜索功能
    $('form').on('submit', function(e){
        e.preventDefault();
        var inputVal = $('input[type=text]').val();
        for(var i=1;i<6;i++){
            $.get("data/page"+ i +".json", function(data){
                var arr = [], thisIndex;
                for(var j=0;j<data.info.length;j++){
                    var name = data.info[j].name.replace(/\s/, '');
                    arr.push(name);
                }
                if($.inArray(inputVal, arr) != -1){
                    thisIndex = arr.indexOf(inputVal);
                    alertInfo(data, thisIndex);
                }
            });
        }

    });



//弹出框技能更新函数
    function skillDom(data){
        var str = '';
        var html =
            '<div class="info-img">' +
            '<img src="img/'+ data.src +'" alt="">' +
            '</div>';
        for(var i=0;i<data.skills.length;i++){
            str += '<div class="media media-botn">'+
                '<div class="media-left">' +
                '<button class="btn btn-default btn-xs" >' +
                ''+ data.skills[i].skill +' &nbsp;<span class="glyphicon glyphicon-volume-down" aria-hidden="true"></span>' +
                '<audio controls="controls" clas="audio"><source src="'+ data.audioSrc[i].audio +'" type="audio/mp3"></audio>' +
                '</button></div>'+
                '<div class="media-body">'+
                '<span>'+ data.skills[i].details +'</span>' +
                '</div></div>';
        }
        html += str;
        return html;
    }
//异步请求函数
    function pageAjax(pageId){
        $.ajax({
            type: "GET",
            url: "data/page"+ pageId +".json",
            dataType: "json",
            success: function(data){
                var $list = "";
                for(var i=0;i<data.info.length;i++){
                    $list += '<div class="col-xs-6 col-md-3">' +
                        '<div class="thumbnail list-item item-nation'+ data.info[i].id +'">' +
                        '<div><img src="img/' + data.info[i].src + '" alt="...">' +
                        '<h4><a href="javascript:;" class="btn btn-primary btn'+ data.info[i].id +'" role="button">' + data.info[i].name + '</a></h4>' +
                        '</div></div></div>';
                }
                $rowList.html("");
                $rowList.html($list);
            },
            error: function(XMLHttpRequest, textStatus, errorThrown){
                console.log("第一个：" + XMLHttpRequest);
                console.log("第二个：" + textStatus);
                console.log("第三个：" + errorThrown);
            }
        });
    }
});
