{
  "info": [
    {
      "name": "关 羽", "src": "2关羽.jpg", "id": "2",
      "audioSrc": [{"audio": "data/audio/关羽武圣.mp3"}],
      "skills": [{"skill": "武圣", "details": "任何时候使用,可将自己的红色花色牌(包括红桃和方块)当[杀]使用。"}],
      "val": [{"attack": "83%"}, {"alive": "80%"}, {"ability": "75%"}],
      "charactor": "关羽（字云长），东汉末年名将，早期跟随刘备辗转各地，曾被曹操生擒，于白马坡斩杀袁绍大将颜良，与张飞一同被称为万人敌。关羽去世后，逐渐被神化，被民间尊为“关公”，又称美髯公。历代朝廷多有褒封，清代奉为“忠义神武灵佑仁勇威显关圣大帝”，崇为“武圣”，与“文圣” 孔子齐名。《三国演义》尊其为蜀国“五虎上将”之首，毛宗岗称其为“《演义》三绝”之“义绝”。",
      "feature": "蜀国多菜刀流武将，很多情况下都是缺杀的但关羽的武圣让他不缺杀。但同样受困于菜刀流的软肋，攻击距离的一个限制。"
    },
    {
      "name": "钟 会", "src": "1钟会.jpg", "id": "1",
      "audioSrc": [{"audio": "data/audio/钟会权计.mp3"}, {"audio": "data/audio/钟会自立.mp3"}, {"audio": "data/audio/钟会排异.mp3"}],
      "skills": [{"skill": "权计", "details": "每当你受到1点伤害后，你可以摸一张牌，然后将一张手牌置于你的武将牌上，称为“权”；锁定技，你的手牌上限+X（X为“权”的数量）。"},
        {"skill": "自立", "details": "觉醒技，准备阶段开始时，若“权”的张数不小于3，你减1点体力上限，选择一项：1.回复1点体力；2.摸两张牌。然后你获得“排异”。"},
        {"skill": "排异", "details": "出牌阶段限一次，你可将一张“权”置入弃牌堆并选择一名角色，令其摸两张牌，然后若其手牌多于你，你对其造成1点伤害。"}],
      "val": [{"attack": "78%"}, {"alive": "80%"}, {"ability": "83%"}],
      "charactor": "钟会（字士季），魏太傅钟繇之幼子、青州刺史钟毓之弟。他在魏国官居要职，是三国后期 魏国重要的策臣与谋士、制定伐蜀计划并参与灭蜀之战的智将。同时也是一位书法家。魏灭蜀之战，钟会与邓艾分兵攻打蜀汉，导致蜀汉灭亡。此后钟会与蜀汉降将姜维共谋，欲据蜀自立，遂打压原同僚邓艾，并且图谋反叛，矫诏起兵 以郭太后遗命之名 讨伐司马昭。却因部下的兵变而失败，自己也死于乱军，时年40岁。",
      "feature": "山包武将都有打后期的能力，打的越慢越好。钟会就属于这一种每一个权都给他提供手牌上限，一对一的情况下钟会是非常强的，但缺点就是输出乏力。作为内奸是比较合适的。"
    },
    {
      "name": "张 郃", "src": "1张郃.jpg", "id": "1",
      "audioSrc": [{"audio": "data/audio/张郃巧变.mp3"}],
      "skills": [{"skill": "巧变", "details": "你可以弃置一张手牌跳过你的一个阶段（回合开始阶段和回合结束阶段除外）；若以此法跳过摸牌阶段，你获得其他至多两名角色各一张手牌；若以此法跳过出牌阶段，你可以将场上的一张牌移动到另一名角色区域里的相应位置。"}],
      "val": [{"attack": "76%"}, {"alive": "85%"}, {"ability": "90%"}],
      "charactor": "张郃（字儁乂），三国时期魏国名将，以用兵巧变、善列营阵，长于利用地形著称，与张辽、曹仁、夏候渊、徐晃并称曹操手下五子良将。东汉末年，张郃应募参加镇压黄巾起义，后属冀州牧韩馥为军司马。191年，袁绍取冀州，张郃率兵投归，任校尉。因破公孙瓒有功，迁为宁国中郎将，在官渡之战中投降曹操。随曹操攻乌桓、破马超、降张鲁，屡建战功。215年，率军进攻巴西宕渠，被蜀将张飞击败。219年，从夏侯渊迎战刘备军于定军山，当夏侯渊战死，全军危急之际，张郃代帅，率部安全撤退。曹丕称帝后，升张郃为左将军，封鄚侯，奉命从曹真击平安定羌胡，后与夏侯尚围攻江陵。228年，随曹真西拒诸葛亮，在街亭大败蜀军，231年，领兵追击蜀军，至木门中箭亡。",
      "feature": "张郃（小八神）比张辽更加优秀，都是辅助控制型武将，张郃不仅限制对手的手牌还可以将场上的装备，控制类锦囊都可以移动，对团队而言是非常优秀的。唯一的缺点和张辽一样就是缺乏输出。"
    },
    {
      "name": "关 平", "src": "2关平.jpg", "id": "2",
      "audioSrc": [{"audio": "data/audio/关平龙吟.mp3"}],
      "skills": [{"skill": "龙吟", "details": "每当一名角色在其出牌阶段使用杀时，你可弃置一张牌令此杀不计入出牌阶段使用次数，若此杀为红色，你摸一张牌。"}],
      "val": [{"attack": "76%"}, {"alive": "78%"}, {"ability": "72%"}],
      "charactor": "关平（生卒年不详），东汉末年名将关羽之子，关羽率军攻打樊城时，孙权借机征讨荆州。关平与其父一同被擒，最后被斩于临沮县。",
      "feature": "关平等于给每一个队友都加装了一个连弩，但对手牌的消耗是比较大的，最好配合的就是关羽只要他有杀，关平可以无止境的过牌。"
    },
    {
      "name": "陈 宫", "src": "4陈宫.jpg", "id": "4",
      "audioSrc": [{"audio": "data/audio/陈宫明策.mp3"}, {"audio": "data/audio/陈宫智迟.mp3"}],
      "skills": [{"skill": "明策", "details": "出牌阶段，你可以交给任一其他角色一张装备牌或【杀】，该角色进行二选一：1. 视为对其攻击范围内的另一名由你指定的角色使用一张【杀】。2. 摸一张牌。每回合限一次。"},
        {"skill": "智迟", "details": "锁定技，你的回合外，你每受到一次伤害，任何【杀】或非延时类锦囊均对你无效，直到该回合结束。"}],
      "val": [{"attack": "87%"}, {"alive": "76%"}, {"ability": "87%"}],
      "charactor": "陈宫（字公台），东汉末年吕布帐下首席谋士，。性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。",
      "feature": "陈宫（小八神）应该是菜刀流武将的最爱，不仅可以让武将成为二刀流也可以为他们提供所需的距离。虽然是三血但是智迟是个非常优秀的防御技能，保证了陈宫的存活能力。"
    },
    {
      "name": "荀 彧", "src": "1荀彧.jpg", "id": "1",
      "audioSrc": [{"audio": "data/audio/荀彧驱虎.mp3"}, {"audio": "data/audio/荀彧节命.mp3"}],
      "skills": [{"skill": "驱虎", "details": "出牌阶段，你可以与一名体力比你多的角色拼点，若你赢，则该角色对其攻击范围内你指定的另一名角色造成1点伤害。若你没赢，则其对你造成1点伤害。每阶段限一次。"},
        {"skill": "节命", "details": "每当你受到1点伤害后，可令一名角色将手牌补至等同于其体力上限的张数（最多补至五张）。"}],
      "val": [{"attack": "93%"}, {"alive": "83%"}, {"ability": "95%"}],
      "charactor": "荀彧（字文若）。东汉末年著名政治家、战略家，曹操统一北方的首席谋臣和功臣。荀彧早年被称为“王佐之才”，初举孝廉，任守宫令。后弃官归乡，又率宗族避难冀州，被袁绍待为上宾。其后投奔曹操。因其任尚书令，居中持重达十数年，处理军国事务，被人敬称为“荀令君”。后因反对曹操称魏公而受曹操所忌，调离中枢，在寿春忧郁成病而亡（一说服毒自尽），年五十。获谥敬侯，后追赠太尉。",
      "feature": "荀彧（八神）可是说是郭嘉的加强版，都是卖血流武将，节命的收益要大于遗计。但郭嘉只能被动的卖血，而文若的驱虎可以选择主动卖血还是打输出。应该说这两个技能配合的天衣无缝。文若无论到哪儿都可以成为团队的核心，也是对手集火的对象但节命的存在又让对手会有很多顾虑。"
    },
    {
      "name": "小 乔", "src": "3小乔.jpg", "id": "3",
      "audioSrc": [{"audio": "data/audio/小乔天香.mp3"}, {"audio": "data/audio/小乔红颜.mp3"}],
      "skills": [{"skill": "天香", "details": "每当你受到伤害时，你可以弃置一张红桃手牌来转移此伤害给一名其他角色，然后该角色摸X张牌（X为该角色当前已损失的体力值）。"},
        {"skill": "红颜", "details": "锁定技，你的黑桃牌均视为红桃牌。"}],
      "val": [{"attack": "70%"}, {"alive": "67%"}, {"ability": "68%"}],
      "charactor": "小桥，本姓桥（小乔为后世误传），中国东汉末年时期的美女。桥公的次女，汉末名将周瑜之妾。周瑜风度翩翩的才子形象，与堪称国色的小桥可称天作之合，由此成为后世文艺作品的对象。唐代著名诗人杜牧激发想象，一句“东风不与周郎便，铜雀春深锁二乔“将小桥与赤壁之战联系起来。而令“”二桥“”闻名于世。",
      "feature": "小乔整体感觉偏弱，可能在特定的局会有表现。算是一个功能性的武将，看情况用天香输出或者助攻。红颜可以让她免去很多控制和伤害。"
    },
    {
      "name": "满 宠", "src": "1满宠.jpg", "id": "1",
      "audioSrc": [{"audio": "data/audio/满宠峻刑.mp3"}, {"audio": "data/audio/满宠御策.mp3"}],
      "skills": [{"skill": "峻刑", "details": "出牌阶段限一次，你可以弃置至少一张手牌并选择一名其他角色，该角色需弃置一张与你弃置的牌类别均不同的手牌，否则其先将其武将牌翻面再摸X张牌（X为你以此法弃置的手牌数量）。"},
        {"skill": "御策", "details": "每当你受到伤害后，你可以展示一张手牌，来源需弃置一张与此牌类别不同的手牌，否则你回复1点体力。"}],
      "val": [{"attack": "79%"}, {"alive": "87%"}, {"ability": "84%"}],
      "charactor": "满宠（字伯宁），三国时期魏国名将。最初在曹操手下任许县县令，掌管司法，以执法严格著称；转任汝南太守，开始参与军事，曾参与赤壁之战。后关羽围攻樊城，满宠协助曹仁守城，劝阻了弃城而逃的计划，成功坚持到援军到来。曹丕在位期间，满宠驻扎在新野，负责荆州侧的对吴作战。曹叡在位期间，满宠转任到扬州，接替曹休负责东侧对吴作战，屡有功劳。后因年迈调回中央任太尉，数年后病逝，谥号景侯。",
      "feature": "满宠两个技能都是非常好的神级技能，峻刑提供强控制，御策保证了他的生存能力，在团队中有非常明确的定位，总体强度属于中上。"
    }
  ]
}